The calculation could not be executed as configured. Select an output node before analyzing this network.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.420)
 Syntax
  C#
public static FailureDefinitionId Network_NoOutputNode { get; }
  Visual Basic
Public Shared ReadOnly Property Network_NoOutputNode As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ Network_NoOutputNode {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures MEPCalculationFailures Class
  Autodesk.Revit.DB Namespace